results/probe/qwen27b_x4_mtp/qwen27b_x4_mtp__router__c256__p8001.log
WARNING 09-02 22:50:31 [import_utils.py:429] Module deep_ep was found but failed to import
WARNING 09-02 22:50:31 [import_utils.py:429] Traceback (most recent call last):
WARNING 09-02 22:50:31 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/vllm/utils/import_utils.py", line 427, in _has_module
WARNING 09-02 22:50:31 [import_utils.py:429]     importlib.import_module(module_name)
WARNING 09-02 22:50:31 [import_utils.py:429]   File "/usr/lib/python3.12/importlib/__init__.py", line 90, in import_module
WARNING 09-02 22:50:31 [import_utils.py:429]     return _bootstrap._gcd_import(name[level:], package, level)
WARNING 09-02 22:50:31 [import_utils.py:429]            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
WARNING 09-02 22:50:31 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1387, in _gcd_import
WARNING 09-02 22:50:31 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1360, in _find_and_load
WARNING 09-02 22:50:31 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1331, in _find_and_load_unlocked
WARNING 09-02 22:50:31 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 935, in _load_unlocked
WARNING 09-02 22:50:31 [import_utils.py:429]   File "<frozen importlib._bootstrap_external>", line 999, in exec_module
WARNING 09-02 22:50:31 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 488, in _call_with_frames_removed
WARNING 09-02 22:50:31 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/deep_ep/__init__.py", line 3, in <module>
WARNING 09-02 22:50:31 [import_utils.py:429]     from .utils import EventOverlap
WARNING 09-02 22:50:31 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/deep_ep/utils.py", line 7, in <module>
WARNING 09-02 22:50:31 [import_utils.py:429]     from deep_ep_cpp import EventHandle
WARNING 09-02 22:50:31 [import_utils.py:429] ImportError: /usr/local/lib/python3.12/dist-packages/deep_ep_cpp.cpython-312-x86_64-linux-gnu.so: undefined symbol: _ZN3c104impl3cow23materialize_cow_storageERNS_11StorageImplE
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7e30249a68e0>, trust_remote_code=True, seed=9235, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8001', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='qwen27b', input_len=None, output_len=None, tokenizer='/workspace/models/Qwen3.8-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['tag=qwen27b_x4_mtp', 'port=8001'], result_dir='/workspace/results/probe/qwen27b_x4_mtp', result_filename='qwen27b_x4_mtp__router__c256__p8001.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,99', goodput=None, request_id_prefix='bench-c20596c3-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-02 22:50:32 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  13.83     
Total input tokens:                      65536     
Total generated tokens:                  8192      
Request throughput (req/s):              4.63      
Output token throughput (tok/s):         592.29    
Peak output token throughput (tok/s):    858.00    
Peak concurrent requests:                64.00     
Total token throughput (tok/s):          5330.61   
---------------Time to First Token----------------
Mean TTFT (ms):                          4953.89   
Median TTFT (ms):                        5057.40   
P50 TTFT (ms):                           5057.40   
P99 TTFT (ms):                           8139.10   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          52.42     
Median TPOT (ms):                        51.09     
P50 TPOT (ms):                           51.09     
P99 TPOT (ms):                           84.73     
---------------Inter-token Latency----------------
Mean ITL (ms):                           114.21    
Median ITL (ms):                         73.57     
P50 ITL (ms):                            73.57     
P99 ITL (ms):                            915.23    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11611.86  
Median E2EL (ms):                        11477.44  
P50 E2EL (ms):                           11477.44  
P99 E2EL (ms):                           13789.86  
---------------Speculative Decoding---------------
Acceptance rate (%):                     40.01     
Acceptance length:                       2.20      
Drafts:                                  3731      
Draft tokens:                            11193     
Accepted tokens:                         4478      
Per-position acceptance (%):
  Position 0:                            51.11     
  Position 1:                            37.95     
  Position 2:                            30.96     
==================================================